-DATASET CSV tinysnb


--

-CASE BasicGenericHashJoin

-LOG A_CROSS_PRODUCT_B_TEST
-STATEMENT MATCH (a:person), (b:person) WHERE a.ID = b.ID AND a.ID = 7 RETURN a.fName, b.fName, a.grades, b.grades
---- 1
Elizabeth|Elizabeth|[96,59,65,88]|[96,59,65,88]

-STATEMENT MATCH (a:person), (b:person) WHERE a.fName = b.fName AND a.ID < 6 RETURN a.fName, b.fName, a.ID, b.ID
---- 4
Alice|Alice|0|0
Bob|Bob|2|2
Carol|Carol|3|3
Dan|Dan|5|5

-STATEMENT MATCH (a:person), (b:person) WHERE a.isWorker = b.isStudent AND a.ID = 0 RETURN b.fName
---- 5
Carol
Dan
Elizabeth
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

-STATEMENT MATCH (a:person), (b:person) WHERE a.height = b.height RETURN COUNT(*)
---- 1
8

-STATEMENT MATCH (a:person), (b:person)
            WHERE a.age = b.age
            AND a.eyeSight = b.eyeSight
            AND a.lastJobDuration = b.lastJobDuration
            AND a.ID > 7
            RETURN a.fName, b.fName
---- 3
Farooq|Farooq
Greg|Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff|Hubert Blaine Wolfeschlegelsteinhausenbergerdorff

# Note vMovies doesn't have ID property
-STATEMENT MATCH (a), (b) WHERE a.ID = b.ID RETURN COUNT(*)
---- 1
11

-STATEMENT MATCH (a:person)-[e1:knows]->(b:person) , (c:person)-[e2:knows]->(d:person) WHERE a.ID = 0 AND c.ID = 2 AND e1.date = e2.date RETURN id(e1), e1.date, id(e2), e2.date
---- 3
1|2021-06-30|1048576|2021-06-30
2|2021-06-30|1048576|2021-06-30
3|2021-06-30|1048576|2021-06-30

-STATEMENT MATCH (a), (b) WHERE a.name = b.name AND a.length = b.length AND a.note = b.note RETURN a.grade, b.grade
---- 3
true|true
8.989|8.989
254|254

-STATEMENT MATCH (a:person), (b:person) WHERE a.workedHours = b.workedHours RETURN a.ID, b.ID
---- 8
0|0
10|10
2|2
3|3
5|5
7|7
8|8
9|9

-STATEMENT MATCH (a:person), (b:person) WHERE a.courseScoresPerTerm = b.courseScoresPerTerm AND a.ID = b.ID RETURN SUM(a.ID)
---- 1
44

-STATEMENT MATCH (a:person), (b:person) WHERE a.grades = b.grades AND a.ID = 2 RETURN a.age
---- 1
30

-STATEMENT MATCH (a:person), (b:person) WHERE a.u = b.u AND a.ID = 0 RETURN a.ID
---- 1
0

-STATEMENT MATCH (o:organisation), (o1:organisation) WHERE o.state = o1.state RETURN o.name
---- 3
ABFsUni
CsWork
DEsWork

-STATEMENT MATCH (v1:movies), (v2:movies) WHERE v1.audience = v2.audience RETURN v1.name
---- 3
Roma
Sóló cón tu párejâ
The 😂😃🧘🏻‍♂️🌍🌦️🍞🚗 movie