-NAME recursive-join-bidirection
-QUERY MATCH (a:PERSON)-[e:KNOWS * 4..4]->(b:PERSON) WHERE a.id = 933 AND b.id=32985349170600 RETURN COUNT(*);
---- 1
10423
