-NAME recursive-join-dense
-QUERY MATCH (a:PERSON)-[e:KNOWS * 3..3]-(b:PERSON) WHERE a.id = 933 RETURN COUNT(*);
---- 1
1866415
