-NAME recursive-join-trail
-QUERY MATCH (a:PERSON)-[e:KNOWS * TRAIL 3..3]-(b:PERSON) WHERE a.id = 933 RETURN COUNT(*);
---- 1
1853620
