-DATASET CSV modern_graph

--

-CASE BasicTests

-LOG TestTestFrameworkWithVertexResults
-STATEMENT MATCH (n:person) RETURN n
---- 4
{_ID: 1:0, _LABEL: person, id: 1, name: marko, age: 29}
{_ID: 1:1, _LABEL: person, id: 2, name: vadas, age: 27}
{_ID: 1:2, _LABEL: person, id: 4, name: josh, age: 32}
{_ID: 1:3, _LABEL: person, id: 6, name: peter, age: 35}

-LOG TestTestFrameworkWithVertexInvolvedResults
-STATEMENT MATCH (n:person) RETURN n.id, n
---- 4
1|{_ID: 1:0, _LABEL: person, id: 1, name: marko, age: 29}
2|{_ID: 1:1, _LABEL: person, id: 2, name: vadas, age: 27}
4|{_ID: 1:2, _LABEL: person, id: 4, name: josh, age: 32}
6|{_ID: 1:3, _LABEL: person, id: 6, name: peter, age: 35}

-LOG TestTestFrameworkWithEDGEResults
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN e;
---- 2
{_ID: 1, _LABEL: knows, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}
{_ID: 2, _LABEL: knows, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}

-LOG TestTestFrameworkWithEdgeInvolvedResults
-STATEMENT MATCH (:person)-[e:knows]->(:person) RETURN e.weight, e
---- 2
0.5|{_ID: 1, _LABEL: knows, _SRC_ID: 0, _DST_ID: 1, weight: 0.5}
1.0|{_ID: 2, _LABEL: knows, _SRC_ID: 0, _DST_ID: 2, weight: 1.0}