-NAME q02
-QUERY MATCH (comment:COMMENT) WHERE comment.length > 200 RETURN MIN(comment.id)
---- 1
8638313