-NAME q23
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.length)
---- 1
2