-NAME q29
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON) RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
318643200000|318643200000
