-NAME q30
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON)-[:KNOWS]->(c:PERSON) RETURN MIN(a.birthday), MIN(b.birthday), MIN(c.birthday)
---- 1
318643200000|318643200000|318643200000
