-NAME q31
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON) WHERE a.id=933 RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
628646400000|499824000000
