-NAME SelectiveTwoHopJoin
-COMPARE_RESULT 1
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON)-[:KNOWS]->(c:PERSON) WHERE a.id=933 RETURN MIN(a.birthday), MIN(b.birthday), MIN(c.birthday)
---- 1
628646400000|499824000000|318643200000
