-NAME q35
-QUERY MATCH (:PERSON {id: 10995116278009})-[:KNOWS]->(friend:PERSON)<-[:comment_hasCreator|:post_hasCreator]-(message:Post:COMMENT) WHERE message.creationDate < timestamp('2010-02-14 20:30:21.451') RETURN friend.id AS personId, friend.firstName AS personFirstName, friend.lastName AS personLastName, message.id AS postOrCommentId, concat(message.content,message.imageFile) AS postOrCommentContent, message.creationDate AS postOrCommentCreationDate ORDER BY postOrCommentCreationDate DESC, postOrCommentId ASC LIMIT 20
---- 0
