-NAME q14
-QUERY MATCH (comment:COMMENT) WHERE comment.length < 3 RETURN count(*)
---- 1
12526