-NAME q16
-QUERY MATCH (comment:COMMENT) WHERE comment.length < 5 or comment.length > 100 RETURN count(*)
---- 1
64188