-NAME q18
-QUERY MATCH (comment:COMMENT) WHERE substr(comment.browserUsed, 1, 2) = 'Ch' RETURN count(*)
---- 1
44324