-NAME zonemap-node
-QUERY MATCH (c:COMMENT) WHERE c.length > 2000 RETURN c;
---- 0
