-NAME zonemap-rel
-QUERY MATCH (a:PERSON)-[l:LIKES]->(b:COMMENT) WHERE l.creationDate > timeStamp("2025-09-13 09:35:59.391") RETURN a, b, l;
---- 0
