-NAME q19
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.browserUsed)
---- 1
Chrome