-NAME q20
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.locationIP)
---- 1
1.0.0.0