-NAME q21
-QUERY MATCH (comment:COMMENT) RETURN SIZE(MIN(comment.content))
---- 1
1756