-NAME q09
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.length - 2 - 2 - 2 - 2 - 2 - 2)
---- 1
-10