-NAME q10
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.length / 2)
---- 1
1