-NAME q13
-QUERY MATCH (comment:COMMENT) RETURN MIN(gamma(comment.length % 2 + 2))
---- 1
1.000000