-NAME q33
-QUERY MATCH (n:PERSON {id: 933})-[r:KNOWS]->(friend) RETURN friend.id AS personId, friend.firstName AS firstName, friend.lastName AS lastName, r.creationDate AS friendshipCreationDate ORDER BY friendshipCreationDate DESC, personId ASC
---- 3
24189255811254|Abdullah|Koksal|1323916483085
10995116278291|Karl|Muller|1289805829104
2199023256077|Ibrahim Bare|Ousmane|1271939457947
