-NAME q31
-QUERY MATCH (a:Person)-[:knows]->(b:Person) WHERE a.ID=933 RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
628646400000|499824000000
