-NAME q22
-QUERY MATCH (post:POST) RETURN MIN(post.language)
---- 1
ar