-NAME q29
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON) RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
1980-02-01|1980-02-01
