-NAME q31
-QUERY MATCH (a:PERSON)-[:KNOWS]->(b:PERSON) WHERE a.id=933 RETURN MIN(a.birthday), MIN(b.birthday)
---- 1
1989-12-03|1980-03-31
