-NAME q03
-QUERY MATCH (comment:COMMENT) RETURN MIN(concat(comment.browserUsed, 'hh'))
---- 1
Chromehh