-NAME q04
-QUERY MATCH (comment:COMMENT) RETURN MIN(substr(comment.browserUsed,1,5))
---- 1
Chrom