-NAME q06
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.browserUsed contains 'ed')
---- 1
False