-NAME q26
-QUERY MATCH (comment:COMMENT) RETURN comment.length as length, comment.creationDate as creationDate ORDER BY length, creationDate LIMIT 5
---- 5
2|1264234458553
2|1264851395623
2|1264851453402
2|1264852169344
2|1264884534871