-NAME q26
-QUERY MATCH (comment:COMMENT) with comment.length, comment.creationDate as length, creationDate RETURN length,creationDate ORDER BY length, creationDate LIMIT 5
---- 5
2|2010-01-02 20:22:45.597
2|2010-01-03 02:37:14.987
2|2010-01-03 16:24:52.269
2|2010-01-03 20:30:56.784
2|2010-01-04 07:25:11.412