-NAME recursive-join-bidirection
-QUERY MATCH (a:Person)-[e:knows * 4..4]->(b:Person) WHERE a.ID = 933 AND b.ID=21990232556027 RETURN COUNT(*);
---- 1
7
