-DATASET CSV tinysnb

--

-CASE AggDistinct

-LOG SingleNodeDistinctAggTest1
-STATEMENT MATCH (a:person) RETURN COUNT(DISTINCT a.gender), COUNT(DISTINCT a.age)
---- 1
2|7

# TODO: EXECUTION: F0617 16:41:02.697162 197721 rt_any.cc:551] not support for 6
-LOG SingleNodeDistinctAggTest2
-STATEMENT MATCH (a:person) RETURN a.gender, COUNT(DISTINCT a.isStudent)
---- 2
1|2
2|2

-LOG TwoHopDistinctAggTest
-SKIP: (compiler): Unsupported operator type for alias management:
-STATEMENT MATCH (a:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN a.ID, SUM(DISTINCT a.age), SUM(DISTINCT c.age)
---- 4
0|35|130
2|30|130
3|45|130
5|20|130

-LOG OneHopDistinctAggTest
-STATEMENT MATCH (p:person)-[:knows]->(:person) RETURN count(distinct p.ID)
---- 1
5

-LOG SimpleDistinctCollectINT64Test
-SKIP: (compiler) Unsupported expression type: LIST_SORT(COLLECT(DISTINCT p.age),ASC)
-STATEMENT MATCH (p:person) RETURN list_sort(collect(distinct p.age), 'ASC')
---- 1
[20,25,30,35,40,45,83]

-LOG HashDistinctCollectDoubleTest
-STATEMENT MATCH (p:person) RETURN p.gender, collect(distinct p.isStudent) ORDER BY p.gender
---- 2
1|[False, True]
2|[False, True]

-STATEMENT MATCH (p:person)-[:knows]->(b:person)-[:knows]->(c:person) RETURN DISTINCT c;
---- 4
{'_ID': 0, '_LABEL': 'person', 'ID': 0, 'fName': 'Alice', 'gender': 1, 'isStudent': True, 'isWorker': False, 'age': 35, 'eyeSight': 5.0, 'birthdate': '1900-01-01', 'registerTime': '2011-08-20T11:25:30Z', 'lastJobDuration': '3 years 2 days 13 hours 2 minutes', 'workedHours': '[10,5]', 'usedNames': '[Aida]', 'courseScoresPerTerm': '[[10,8],[6,7,8]]', 'grades': '[96,54,86,92]', 'height': 1.731, 'u': 'A0EEBC99-9C0B-4EF8-BB6D-6BB9BD380A11'} 
{'_ID': 2, '_LABEL': 'person', 'ID': 3, 'fName': 'Carol', 'gender': 1, 'isStudent': False, 'isWorker': True, 'age': 45, 'eyeSight': 5.0, 'birthdate': '1940-06-22', 'registerTime': '1911-08-20T02:32:21Z', 'lastJobDuration': '48 hours 24 minutes 11 seconds', 'workedHours': '[4,5]', 'usedNames': '[Carmen,Fred]', 'courseScoresPerTerm': '[[8,10]]', 'grades': '[91,75,21,95]', 'height': 1.0, 'u': 'a0eebc999c0b4ef8bb6d6bb9bd380a13'}
{'_ID': 3, '_LABEL': 'person', 'ID': 5, 'fName': 'Dan', 'gender': 2, 'isStudent': False, 'isWorker': True, 'age': 20, 'eyeSight': 4.8, 'birthdate': '1950-07-23', 'registerTime': '2031-11-30T12:25:30Z', 'lastJobDuration': '10 years 5 months 13 hours 24 microseconds', 'workedHours': '[1,9]', 'usedNames': '[Wolfeschlegelstein,Daniel]', 'courseScoresPerTerm': '[[7,4],[8,8],[9]]', 'grades': '[76,88,99,89]', 'height': 1.3, 'u': 'a0ee-bc99-9c0b-4ef8-bb6d-6bb9-bd38-0a14'}
{'_ID': 1, '_LABEL': 'person', 'ID': 2, 'fName': 'Bob', 'gender': 2, 'isStudent': True, 'isWorker': False, 'age': 30, 'eyeSight': 5.1, 'birthdate': '1900-01-01', 'registerTime': '2008-11-03T13:25:30Z', 'lastJobDuration': '10 years 5 months 13 hours 24 microseconds', 'workedHours': '[12,8]', 'usedNames': '[Bobby]', 'courseScoresPerTerm': '[[8,9],[9,10]]', 'grades': '[98,42,93,88]', 'height': 0.99, 'u': '{a0eebc99-9c0b-4ef8-bb6d-6bb9bd380a12}'}

-STATEMENT MATCH (p:person)-[:knows]->(b:person)-[e:knows]->(c:person)-[:knows]->(:person) RETURN DISTINCT e;
---- 12
{'_ID': 1, '_LABEL': 'knows', '_SRC_ID': 0, '_DST_ID': 1, 'date': '2021-06-30', 'meetTime': '1986-10-21 21:08:31.521', 'validInterval': '10 years 5 months 13 hours 24 us', 'comments': '[rnme,m8sihsdnf2990nfiwf]', 'summary': "{locations:['toronto','waterloo'], transfer: {day: 2021-01-02, amount: [100, 200]}}", 'notes': '1', 'someMap': '{a=b}'}
{'_ID': 2, '_LABEL': 'knows', '_SRC_ID': 0, '_DST_ID': 2, 'date': '2021-06-30', 'meetTime': '1946-08-25 19:07:22', 'validInterval': '20 years 30 days 48 hours', 'comments': '[njnojppo9u0jkmf,fjiojioh9h9h89hph]', 'summary': '{}', 'notes': '2020-10-10', 'someMap': '{c=d, e=f, 1=2}'}
{'_ID': 3, '_LABEL': 'knows', '_SRC_ID': 0, '_DST_ID': 3, 'date': '2021-06-30', 'meetTime': '2012-12-11 20:07:22', 'validInterval': '10 days', 'comments': '[ioji232,jifhe8w99u43434]', 'summary': "{locations:['shanghai'], transfer: {day: 1990-09-10, amount: [10]}}", 'notes': 'nice weather', 'someMap': ''}
{'_ID': 1048576, '_LABEL': 'knows', '_SRC_ID': 1, '_DST_ID': 0, 'date': '2021-06-30', 'meetTime': '1946-08-25 19:07:22', 'validInterval': '10 years 5 months 13 hours 24 us', 'comments': '[2huh9y89fsfw23,23nsihufhw723]', 'summary': "{locations:['paris'], transfer: {day: 2000-01-01, amount: [20, 5000]}}", 'notes': '4', 'someMap': ''}
{'_ID': 1048578, '_LABEL': 'knows', '_SRC_ID': 1, '_DST_ID': 2, 'date': '1950-05-14', 'meetTime': '1946-08-25 19:07:22', 'validInterval': '23 minutes', 'comments': '[fwehu9h9832wewew,23u9h989sdfsss]', 'summary': "{locations:['paris'], transfer: {day: 2011-05-01, amount: [2000, 5340]}}", 'notes': 'cool stuff found', 'someMap': ''}
{'_ID': 1048579, '_LABEL': 'knows', '_SRC_ID': 1, '_DST_ID': 3, 'date': '1950-05-14', 'meetTime': '2012-12-11 20:07:22', 'validInterval': '20 years 30 days 48 hours', 'comments': '[fwh9y81232uisuiehuf,ewnuihxy8dyf232]', 'summary': "{locations:['vancouver'], transfer: {day: 2020-01-01, amount: [120, 50]}}", 'notes': 'matthew perry', 'someMap': ''}
{'_ID': 2097152, '_LABEL': 'knows', '_SRC_ID': 2, '_DST_ID': 0, 'date': '2021-06-30', 'meetTime': '2002-07-31 11:42:53.12342', 'validInterval': '30 hours 40 days', 'comments': '[fnioh8323aeweae34d,osd89e2ejshuih12]', 'summary': "{locations:['london','toronto'], transfer: {day: 2012-11-21, amount: [223, 5230]}}", 'notes': '10', 'someMap': ''}
{'_ID': 2097153, '_LABEL': 'knows', '_SRC_ID': 2, '_DST_ID': 1, 'date': '1950-05-14', 'meetTime': '2007-02-12 12:11:42.123', 'validInterval': '28 minutes 30 milliseconds', 'comments': '[fwh983-sdjisdfji,ioh89y32r2huir]', 'summary': "{locations:['paris','beijing'], transfer: {day: 2011-03-11, amount: [2323, 50]}}", 'notes': '1', 'someMap': ''}
{'_ID': 2097155, '_LABEL': 'knows', '_SRC_ID': 2, '_DST_ID': 3, 'date': '2000-01-01', 'meetTime': '1998-10-02 13:09:22.423', 'validInterval': '300 milliseconds', 'comments': '[psh989823oaaioe,nuiuah1nosndfisf]', 'summary': '{locations:[], transfer: {day: 1980-11-21, amount: [20, 5]}}', 'notes': '2', 'someMap': ''}
{'_ID': 3145728, '_LABEL': 'knows', '_SRC_ID': 3, '_DST_ID': 0, 'date': '2021-06-30', 'meetTime': '1936-11-02 11:02:01', 'validInterval': '480us', 'comments': '[fwewe]', 'summary': "{locations:['shanghai','nanjing'], transfer: {day: 1998-11-12, amount: [22, 53240]}}", 'notes': '15', 'someMap': ''}
{'_ID': 3145729, '_LABEL': 'knows', '_SRC_ID': 3, '_DST_ID': 1, 'date': '1950-05-14', 'meetTime': '1982-11-11 13:12:05.123', 'validInterval': '23 minutes', 'comments': '[fewh9182912e3,h9y8y89soidfsf,nuhudf78w78efw,hioshe0f9023sdsd]', 'summary': "{locations:['paris'], transfer: {day: 2000-01-01, amount: [20, 5000]}}", 'notes': 'happy new year', 'someMap': ''}
{'_ID': 3145730, '_LABEL': 'knows', '_SRC_ID': 3, '_DST_ID': 2, 'date': '2000-01-01', 'meetTime': '1999-04-21 15:12:11.42', 'validInterval': '48 hours 52 milliseconds', 'comments': '[23h9sdslnfowhu2932,shuhf98922323sf]', 'summary': "{locations:['paris'], transfer: {day: 2000-01-01, amount: [20, 5000]}}", 'notes': '4', 'someMap': ''}
-LOG CollectDistinct
-STATEMENT UNWIND [1,1,3] AS a MATCH (b:person) RETURN COUNT(*);
---- 1
24
-STATEMENT UNWIND [1,1,3] AS x MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=5 RETURN COUNT(*);
---- 1
9
-STATEMENT UNWIND [1,1,3] AS a MATCH (b:person) WITH COLLECT(DISTINCT b) AS bs UNWIND bs AS newB RETURN newB.fName;
---- 8
Alice
Bob
Carol
Dan
Elizabeth
Farooq
Greg
Hubert Blaine Wolfeschlegelsteinhausenbergerdorff
-STATEMENT UNWIND [1,1,3] AS x MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=5 WITH COLLECT(DISTINCT e) AS es UNWIND es AS newE RETURN newE.date;
---- 3
1950-05-14
2000-01-01
2021-06-30
-STATEMENT UNWIND [1,1,3] AS a MATCH (b:person) WHERE b.ID < 6 WITH a, COLLECT(DISTINCT b) AS bs UNWIND bs AS newB RETURN a, newB.fName;
---- 8
1|Alice
1|Bob
1|Carol
1|Dan
3|Alice
3|Bob
3|Carol
3|Dan
-STATEMENT UNWIND [1,1,3] AS x MATCH (a:person)-[e:knows]->(b:person) WHERE a.ID=5 WITH x, COLLECT(DISTINCT e) AS es UNWIND es AS newE RETURN x, newE.date;
---- 6
1|1950-05-14
1|2000-01-01
1|2021-06-30
3|1950-05-14
3|2000-01-01
3|2021-06-30
-STATEMENT UNWIND [1,1] AS x MATCH (a:person) WHERE a.ID < 3 MATCH (b:person) WHERE b.ID < 6 AND b.ID > 2 WITH a, COLLECT(DISTINCT b) AS bs UNWIND bs AS newB RETURN a.fName, newB.fName;
---- 4
Alice|Carol
Alice|Dan
Bob|Carol
Bob|Dan
-STATEMENT UNWIND [1,1] AS x MATCH (a:person)-[e:knows]->() WHERE a.ID = 5 MATCH (b:person) WHERE b.ID < 6 AND b.ID > 2 WITH e, COLLECT(DISTINCT b) AS bs UNWIND bs AS newB RETURN e.date, newB.fName;
---- 6
1950-05-14|Carol
1950-05-14|Dan
2000-01-01|Carol
2000-01-01|Dan
2021-06-30|Carol
2021-06-30|Dan

-LOG DistinctRecursiveRel
-STATEMENT MATCH (:person), (a:person)-[t:knows*2..2]->(b:person) RETURN count(DISTINCT t);
---- 1
36

-LOG DoubleColumnsDistinct
-STATEMENT MATCH (a:person) RETURN DISTINCT a.fName, a.gender limit 5;
---- 5
Alice|1
Bob|2
Carol|1
Dan|2
Elizabeth|1
-LOG ThreeColumnsDistinct
-STATEMENT MATCH (a:person) RETURN DISTINCT a.fName, a.gender, a.age limit 5;
---- 5
Alice|1|35
Bob|2|30
Carol|1|45
Dan|2|20
Elizabeth|1|20
-LOG FourColumnsDistinct
-STATEMENT MATCH (a:person) RETURN DISTINCT a.fName, a.gender, a.age, a.eyeSight limit 5;
---- 5
Alice|1|35|5.0
Bob|2|30|5.1
Carol|1|45|5.0
Dan|2|20|4.8
Elizabeth|1|20|4.7

-LOG PrimaryKeyDistinct
-STATEMENT MATCH (a:person) RETURN DISTINCT a.id, a.fName, a.gender limit 5;
---- 5
0|Alice|1
2|Bob|2
3|Carol|1
5|Dan|2
7|Elizabeth|1