-NAME q11
-QUERY MATCH (comment:COMMENT) RETURN MIN(comment.length % 111)
---- 1
0