-NAME q12
-QUERY MATCH (comment:COMMENT) RETURN MIN(abs(comment.length))
---- 1
2