-NAME q05
-QUERY MATCH (comment:COMMENT) RETURN MIN(upper(comment.browserUsed))
---- 1
CHROME