-NAME q15
-QUERY MATCH (comment:COMMENT) WHERE comment.length < 150 RETURN count(*)
---- 1
215554222