-NAME q17
-QUERY MATCH (comment:COMMENT) WHERE comment.length < comment.id % 10 RETURN count(*)
---- 1
70616461