-NAME q01
-QUERY MATCH (comment:COMMENT) WHERE comment.length < 10 RETURN MIN(comment.id)
---- 1
32485